In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
# from pprint import pprint
# from lxml import html
# from lxml.html import fromstring
#import urllib.request
#from urllib.request import urlopen
#from selenium import webdriver
# import random
#import re
# import scrapy
#

In [70]:
url = 'https://www.archives.gov/electoral-college/1980'
html = requests.get(url).content
table = pd.read_html(html)
#soup = BeautifulSoup(html, "lxml")
#soup

In [72]:
results_df = table[1]

In [74]:
results_df.columns = ['state','electoral_votes'] + list(results_df.iloc[0,0:4])

In [75]:
results_df.insert(0,'year',1980)

In [76]:
# drop header row
results_df = results_df.drop(results_df.index[0])

In [78]:
# drop VP Columns
num_veeps = int((results_df.shape[1]-3)/2)
veep_names = results_df.columns[-num_veeps:]
results_df = results_df.drop(veep_names, axis = 1)

In [36]:
results_df.columns[2:6]

Index(['Ronald Reagan,  of  California', 'Jimmy Carter,  of  Georgia',
       'George Bush,  of  Texas', 'Walter F. Mondale,  of  Minnesota'],
      dtype='object')

In [40]:
pd.melt(results_df,id_vars =['year', 'state'], value_vars = results_df.columns[2:6])

     year          state                           variable value
0    1980        Alabama     Ronald Reagan,  of  California     9
1    1980         Alaska     Ronald Reagan,  of  California     3
2    1980        Arizona     Ronald Reagan,  of  California     6
3    1980       Arkansas     Ronald Reagan,  of  California     6
4    1980     California     Ronald Reagan,  of  California    45
..    ...            ...                                ...   ...
203  1980     Washington  Walter F. Mondale,  of  Minnesota     -
204  1980  West Virginia  Walter F. Mondale,  of  Minnesota     6
205  1980      Wisconsin  Walter F. Mondale,  of  Minnesota     -
206  1980        Wyoming  Walter F. Mondale,  of  Minnesota     -
207  1980          Total  Walter F. Mondale,  of  Minnesota    49

[208 rows x 4 columns]

In [58]:
results_df.head()

,year,state,electoral_votes,"Ronald Reagan, of California","Jimmy Carter, of Georgia","George Bush, of Texas","Walter F. Mondale, of Minnesota"
51,1980,Wyoming,3,3,-,3,-
52,1980,Total,538,489,49,489,49

In [59]:
results_df.shape[1]

7

In [62]:
r1 = list(range(10))

In [63]:
r1[:-3]

[0, 1, 2, 3, 4, 5, 6]

In [88]:
r1[0:-2]

[0, 1, 2, 3, 4, 5, 6, 7]

In [79]:
results_df.head()

,year,state,electoral_votes,"Ronald Reagan, of California","Jimmy Carter, of Georgia"
1,1980,Alabama,9,9,-
2,1980,Alaska,3,3,-
3,1980,Arizona,6,6,-
4,1980,Arkansas,6,6,-
5,1980,California,45,45,-

In [85]:
results_df.melt(id_vars =['year', 'state'], value_vars = results_df.columns[3:], var_name = 'candidate',value_name='electoral_votes')

     year          state                       candidate electoral_votes
0    1980        Alabama  Ronald Reagan,  of  California               9
1    1980         Alaska  Ronald Reagan,  of  California               3
2    1980        Arizona  Ronald Reagan,  of  California               6
3    1980       Arkansas  Ronald Reagan,  of  California               6
4    1980     California  Ronald Reagan,  of  California              45
..    ...            ...                             ...             ...
99   1980     Washington      Jimmy Carter,  of  Georgia               -
100  1980  West Virginia      Jimmy Carter,  of  Georgia               6
101  1980      Wisconsin      Jimmy Carter,  of  Georgia               -
102  1980        Wyoming      Jimmy Carter,  of  Georgia               -
103  1980          Total      Jimmy Carter,  of  Georgia              49

[104 rows x 4 columns]

In [91]:
df = pd.DataFrame()
for year in range(1976,2020,4):
    url = f'https://www.archives.gov/electoral-college/{year}'
    html = requests.get(url).content
    table = pd.read_html(html)
    results_df = table[1]
    results_df.columns = ['state','electoral_votes'] + list(results_df.iloc[0,0:-2])
    results_df.insert(0,'year',year)
    
    # drop header row
    results_df = results_df.drop(results_df.index[0])
    
    # drop VP Columns
    num_veeps = int((results_df.shape[1]-3)/2)
    veep_names = results_df.columns[-num_veeps:]
    results_df.drop(veep_names, axis = 1, inplace = True)
    
    df = df.append(results_df.melt(id_vars =['year', 'state'], value_vars = results_df.columns[3:], var_name = 'candidate',value_name='electoral_votes'))

In [92]:
df['year'].unique()

array([1976, 1980, 1984, 1988, 1992, 1996, 2000, 2004, 2008, 2012, 2016],
      dtype=int64)

In [96]:
df[df['year'] == 2012]

     year          state                      candidate electoral_votes
0    2012        Alabama      Barack Obama, of Illinois               -
1    2012         Alaska      Barack Obama, of Illinois               -
2    2012        Arizona      Barack Obama, of Illinois               -
3    2012       Arkansas      Barack Obama, of Illinois               -
4    2012     California      Barack Obama, of Illinois              55
..    ...            ...                            ...             ...
99   2012     Washington  Mitt Romney, of Massachusetts               -
100  2012  West Virginia  Mitt Romney, of Massachusetts               5
101  2012      Wisconsin  Mitt Romney, of Massachusetts               -
102  2012        Wyoming  Mitt Romney, of Massachusetts               3
103  2012          Total  Mitt Romney, of Massachusetts             206

[104 rows x 4 columns]